cases/chpt5-trial-burst/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
  {
    name    base_metal;
//    type    cellZoneSet;
    type    cellSet;
    action  new;
    source  boxToCell;
    sourceInfo
    {
      box (-10 -10 -10) (10 10 0.006);
    }
  }
  /*
  {
    name    base_metal_plus;
    type    cellZoneSet;
    action  new;
    source  boxToCell;
    sourceInfo
    {
      box (-10 -10 0) (10 10 0.025);
    }
  }
  {
    name    layer1;
    type    cellZoneSet;
    action  new;
    source  boxToCell;
    sourceInfo
    {
      box (-10 -10 0.0235) (10 10 4);
    }
  }
  */
);

// ************************************************************************* //
